{
  "id": "eberron",
  "translations": {
    "en": {
      "label": "Eberron Calendar (D&D)",
      "description": "The Galifar Calendar used in the D&D Eberron campaign setting. Features twelve months of 28 days each, creating a perfectly regular 336-day year with no leap years.",
      "setting": "D&D Eberron"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 998,
    "prefix": "",
    "suffix": " YK",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "none"
  },
  
  "months": [
    {
      "name": "Zarantyr",
      "abbreviation": "Zar",
      "days": 28,
      "description": "The Storm Month. Named after the mark of storms, representing the tempestuous start of the new year and the power of elemental forces."
    },
    {
      "name": "Olarune",
      "abbreviation": "Ola",
      "days": 28,
      "description": "The Sentinel Month. Named after the mark of the sentinel, representing vigilance, protection, and the watchful guardians of civilization."
    },
    {
      "name": "Therendor",
      "abbreviation": "The",
      "days": 28,
      "description": "The Healing Month. Named after the mark of healing, representing restoration, renewal, and the nurturing care of life itself."
    },
    {
      "name": "Eyre",
      "abbreviation": "Eyr",
      "days": 28,
      "description": "The Making Month. Named after the mark of making, representing creation, craftsmanship, and the forging of new possibilities."
    },
    {
      "name": "Dravago",
      "abbreviation": "Dra",
      "days": 28,
      "description": "The Handling Month. Named after the mark of handling, representing mastery over beasts and the wild, and the bonds between civilization and nature."
    },
    {
      "name": "Nymm",
      "abbreviation": "Nym",
      "days": 28,
      "description": "The Hospitality Month. Named after the mark of hospitality, representing welcome, comfort, and the generous spirit of community."
    },
    {
      "name": "Lharvion",
      "abbreviation": "Lha",
      "days": 28,
      "description": "The Detection Month. Named after the mark of detection, representing discovery, investigation, and the uncovering of hidden truths."
    },
    {
      "name": "Barrakas",
      "abbreviation": "Bar",
      "days": 28,
      "description": "The Finding Month. Named after the mark of finding, representing location, guidance, and the discovery of lost or hidden things."
    },
    {
      "name": "Rhaan",
      "abbreviation": "Rha",
      "days": 28,
      "description": "The Scribing Month. Named after the mark of scribing, representing knowledge, communication, and the preservation of wisdom through writing."
    },
    {
      "name": "Sypheros",
      "abbreviation": "Syp",
      "days": 28,
      "description": "The Shadow Month. Named after the mark of shadow, representing mystery, subtlety, and the hidden aspects of existence."
    },
    {
      "name": "Aryth",
      "abbreviation": "Ary",
      "days": 28,
      "description": "The Passage Month. Named after the mark of passage, representing travel, transition, and the movement between places and states of being."
    },
    {
      "name": "Vult",
      "abbreviation": "Vul",
      "days": 28,
      "description": "The Warding Month. Named after the mark of warding, representing protection, security, and the defense against hostile forces."
    }
  ],
  
  "weekdays": [
    {
      "name": "Sul",
      "abbreviation": "Su",
      "description": "First day of the week, often used for worship and spiritual reflection"
    },
    {
      "name": "Mol",
      "abbreviation": "Mo",
      "description": "Second day of the week, traditionally the start of the working period"
    },
    {
      "name": "Zol",
      "abbreviation": "Zo",
      "description": "Third day of the week, a common day for travel and commerce"
    },
    {
      "name": "Wir",
      "abbreviation": "Wi",
      "description": "Fourth day of the week, often devoted to important meetings and negotiations"
    },
    {
      "name": "Zor",
      "abbreviation": "Zo",
      "description": "Fifth day of the week, a day for craft work and skilled labor"
    },
    {
      "name": "Far",
      "abbreviation": "Fa",
      "description": "Sixth day of the week, commonly used for social gatherings and entertainment"
    },
    {
      "name": "Sar",
      "abbreviation": "Sa",
      "description": "Seventh day of the week, traditionally a day of rest and family time"
    }
  ],
  
  "intercalary": [],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}