{
  "id": "forgotten-realms",
  "translations": {
    "en": {
      "label": "Calendar of Harptos (Forgotten Realms)",
      "description": "The standard calendar of Faerûn, featuring twelve 30-day months interspersed with festival days that fall outside the normal monthly structure. Used throughout the Forgotten Realms in D&D campaigns.",
      "setting": "D&D Forgotten Realms"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 1495,
    "prefix": "",
    "suffix": " DR",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "custom",
    "interval": 4
  },
  
  "months": [
    {
      "name": "Hammer",
      "abbreviation": "Ham",
      "days": 30,
      "description": "The deepest winter month, named for the need to break ice for water. A time of cold, darkness, and huddled warmth around hearth fires."
    },
    {
      "name": "Alturiak",
      "abbreviation": "Alt", 
      "days": 30,
      "description": "The Claw of Winter. Storms rage and travel becomes treacherous. Also called 'The Claws of the Cold'."
    },
    {
      "name": "Ches",
      "abbreviation": "Che",
      "days": 30,
      "description": "The Claw of the Sunsets. Late winter begins to break, but cold snaps still threaten. The month of planning for spring."
    },
    {
      "name": "Tarsakh", 
      "abbreviation": "Tar",
      "days": 30,
      "description": "The Claw of the Storms. Spring rains and winds arrive with violent storms. Roads become muddy and travel difficult."
    },
    {
      "name": "Mirtul",
      "abbreviation": "Mir",
      "days": 30,
      "description": "The Melting. Late spring brings warmth and the final melting of winter snow. Planting season begins in earnest."
    },
    {
      "name": "Kythorn",
      "abbreviation": "Kyt", 
      "days": 30,
      "description": "The Time of Flowers. Early summer brings blooming flowers and mild weather. A popular time for weddings and festivals."
    },
    {
      "name": "Flamerule",
      "abbreviation": "Fla",
      "days": 30,
      "description": "Summertide. The height of summer with sweltering heat. Named for the oppressive temperatures that rule this month."
    },
    {
      "name": "Eleasis",
      "abbreviation": "Ele",
      "days": 30,
      "description": "Highsun. The hottest month of the year. Crops grow rapidly but water becomes precious. Also called 'The Deep Summer'."
    },
    {
      "name": "Eleint",
      "abbreviation": "Ele", 
      "days": 30,
      "description": "The Fading. Early autumn brings cooler weather and the beginning of harvest season. Leaves start to change color."
    },
    {
      "name": "Marpenoth",
      "abbreviation": "Mar",
      "days": 30,
      "description": "Leaffall. Mid-autumn brings falling leaves and the main harvest. A time of preparation for the coming winter."
    },
    {
      "name": "Uktar",
      "abbreviation": "Ukt",
      "days": 30,
      "description": "The Rotting. Late autumn brings decay and the first frosts. The final preparations for winter are completed."
    },
    {
      "name": "Nightal",
      "abbreviation": "Nig",
      "days": 30,
      "description": "The Drawing Down. Early winter brings short days and long nights. The year draws to its close in cold and darkness."
    }
  ],
  
  "weekdays": [
    {
      "name": "1st",
      "abbreviation": "1s",
      "description": "First day of the tenday, often used for planning and new endeavors"
    },
    {
      "name": "2nd", 
      "abbreviation": "2n",
      "description": "Second day of the tenday, a common day for beginning journeys"
    },
    {
      "name": "3rd",
      "abbreviation": "3r", 
      "description": "Third day of the tenday, often devoted to crafts and trade"
    },
    {
      "name": "4th",
      "abbreviation": "4t",
      "description": "Fourth day of the tenday, a day for business and commerce"
    },
    {
      "name": "5th",
      "abbreviation": "5t",
      "description": "Fifth day of the tenday, the middle day often used for important meetings"
    },
    {
      "name": "6th",
      "abbreviation": "6t", 
      "description": "Sixth day of the tenday, commonly a day for visiting and socializing"
    },
    {
      "name": "7th",
      "abbreviation": "7t",
      "description": "Seventh day of the tenday, often devoted to learning and study"
    },
    {
      "name": "8th",
      "abbreviation": "8t",
      "description": "Eighth day of the tenday, a day for worship and religious observances"
    },
    {
      "name": "9th", 
      "abbreviation": "9t",
      "description": "Ninth day of the tenday, commonly used for festivals and celebrations"
    },
    {
      "name": "10th",
      "abbreviation": "10",
      "description": "Tenth day of the tenday, the final day often used for rest and reflection"
    }
  ],
  
  "intercalary": [
    {
      "name": "Midwinter",
      "after": "Hammer",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Also known as Deadwinter Day. A solemn festival marking the midpoint of winter, when the year is symbolically reborn. A time for remembering the dead and making resolutions."
    },
    {
      "name": "Greengrass",
      "after": "Tarsakh", 
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "A festival welcoming the first day of spring. Communities gather to celebrate renewal, growth, and the end of winter's grip. Often includes dancing around maypoles."
    },
    {
      "name": "Midsummer",
      "after": "Flamerule",
      "leapYearOnly": false, 
      "countsForWeekdays": false,
      "description": "A festival celebrating love, music, and the peak of summer. The longest day of the year is marked with feasts, music, dancing, and romantic pursuits."
    },
    {
      "name": "Shieldmeet",
      "after": "Flamerule",
      "leapYearOnly": true,
      "countsForWeekdays": false,
      "description": "Occurs only once every four years, the day after Midsummer. A grand festival of unity, oaths, and great celebrations. Political alliances are often forged on this day."
    },
    {
      "name": "Higharvestide", 
      "after": "Eleint",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "A festival celebrating the autumn harvest. Communities gather to give thanks for the year's bounty and prepare for winter. Markets overflow with the season's produce."
    },
    {
      "name": "Feast of the Moon",
      "after": "Uktar",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "A festival honoring the dead and ancestors. The boundaries between life and death are thinnest on this night. Stories of heroes and ancestors are shared around fires."
    }
  ],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}