{
  "id": "greyhawk",
  "translations": {
    "en": {
      "label": "Greyhawk Calendar (D&D)",
      "description": "The Common Year calendar system used in the World of Greyhawk, the classic D&D campaign setting. Features twelve months and four festival weeks that fall outside normal monthly structure.",
      "setting": "D&D Greyhawk"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 591,
    "prefix": "",
    "suffix": " cy",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "none"
  },
  
  "months": [
    {
      "name": "Fireseek",
      "abbreviation": "Fir",
      "days": 28,
      "description": "The first month of winter. Named for the desperate search for fire and warmth during the coldest part of the year."
    },
    {
      "name": "Readying",
      "abbreviation": "Rea",
      "days": 28,
      "description": "The second month of winter. A time of preparation and planning for the coming spring planting season."
    },
    {
      "name": "Coldeven",
      "abbreviation": "Col",
      "days": 28,
      "description": "The third month of winter. The harshest and most bitter month, when cold winds dominate the land."
    },
    {
      "name": "Planting",
      "abbreviation": "Pla",
      "days": 28,
      "description": "The first month of spring. The season of sowing begins as farmers plant their crops for the coming harvest."
    },
    {
      "name": "Flocktime",
      "abbreviation": "Flo",
      "days": 28,
      "description": "The second month of spring. Animals give birth and flocks grow as nature awakens from winter slumber."
    },
    {
      "name": "Wealsun",
      "abbreviation": "Wea",
      "days": 28,
      "description": "The third month of spring. The sun grows strong and wealthy, bringing prosperity and growth to the lands."
    },
    {
      "name": "Reaping",
      "abbreviation": "Rea",
      "days": 28,
      "description": "The first month of summer. The early harvest begins as the first crops reach maturity under the summer sun."
    },
    {
      "name": "Goodmonth",
      "abbreviation": "Goo",
      "days": 28,
      "description": "The second month of summer. A favorable time when weather is pleasant and crops grow well."
    },
    {
      "name": "Harvester",
      "abbreviation": "Har",
      "days": 28,
      "description": "The third month of summer. The main harvest season when crops are gathered and stored for winter."
    },
    {
      "name": "Patchwall",
      "abbreviation": "Pat",
      "days": 28,
      "description": "The first month of autumn. Time to repair and patch things before winter's arrival brings its harsh tests."
    },
    {
      "name": "Ready'reat",
      "abbreviation": "Rea",
      "days": 28,
      "description": "The second month of autumn. Final preparations are made to retreat indoors for the coming winter."
    },
    {
      "name": "Sunsebb",
      "abbreviation": "Sun",
      "days": 28,
      "description": "The third month of autumn. The sun's power ebbs and weakens as the year draws toward its close."
    }
  ],
  
  "weekdays": [
    {
      "name": "Starday",
      "abbreviation": "St",
      "description": "First day of the week, sacred to celestial observation and divination"
    },
    {
      "name": "Sunday",
      "abbreviation": "Su",
      "description": "Second day of the week, devoted to the sun and solar deities"
    },
    {
      "name": "Moonday",
      "abbreviation": "Mo",
      "description": "Third day of the week, sacred to the moon and lunar mysteries"
    },
    {
      "name": "Godsday",
      "abbreviation": "Go",
      "description": "Fourth day of the week, devoted to worship and religious observances"
    },
    {
      "name": "Waterday",
      "abbreviation": "Wa",
      "description": "Fifth day of the week, associated with water, travel, and commerce"
    },
    {
      "name": "Earthday",
      "abbreviation": "Ea",
      "description": "Sixth day of the week, devoted to agriculture, craftsmanship, and earthly labors"
    },
    {
      "name": "Freeday",
      "abbreviation": "Fr",
      "description": "Seventh day of the week, a day of freedom, rest, and personal pursuits"
    }
  ],
  
  "intercalary": [
    {
      "name": "Needfest",
      "days": 7,
      "after": "Sunsebb",
      "leapYearOnly": false,
      "countsForWeekdays": true,
      "description": "A week-long festival at year's end celebrating the winter solstice. A time of giving gifts to those in need and sharing warmth during the coldest season."
    },
    {
      "name": "Growfest",
      "days": 7,
      "after": "Coldeven",
      "leapYearOnly": false,
      "countsForWeekdays": true,
      "description": "A week-long festival celebrating the spring equinox and the return of growing season. Communities prepare for planting and new life."
    },
    {
      "name": "Richfest",
      "days": 7,
      "after": "Wealsun",
      "leapYearOnly": false,
      "countsForWeekdays": true,
      "description": "A week-long festival celebrating the summer solstice and the year's abundance. The peak celebration of wealth, prosperity, and the sun's power."
    },
    {
      "name": "Brewfest",
      "days": 7,
      "after": "Harvester",
      "leapYearOnly": false,
      "countsForWeekdays": true,
      "description": "A week-long festival celebrating the autumn equinox and the completed harvest. Communities brew ale and celebrate the year's bounty with feasting and drinking."
    }
  ],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}