{
  "id": "symbaroum",
  "translations": {
    "en": {
      "label": "Symbaroum Calendar",
      "description": "The calendar system used in the dark fantasy world of Symbaroum, featuring twelve months of 30 days each, named for their seasonal characteristics and agricultural significance.",
      "setting": "Symbaroum RPG"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 22,
    "prefix": "",
    "suffix": "",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "none"
  },
  
  "months": [
    {
      "name": "Ynedar",
      "abbreviation": "Yne",
      "days": 30,
      "description": "High Summer Month. The peak of summer's heat and abundance, when the sun blazes strongest and crops ripen under its burning gaze."
    },
    {
      "name": "Olandan",
      "abbreviation": "Ola",
      "days": 30,
      "description": "Harvest Month. The time of reaping and gathering, when communities work together to bring in the year's bounty before winter's approach."
    },
    {
      "name": "Adonia",
      "abbreviation": "Ado",
      "days": 30,
      "description": "Wither Month. Nature begins its retreat as leaves fall and plants prepare for the coming dormancy of winter's embrace."
    },
    {
      "name": "Tomol",
      "abbreviation": "Tom",
      "days": 30,
      "description": "Slaughter Month. The traditional time for culling livestock and preserving meat for the long, dark months ahead."
    },
    {
      "name": "Serliela",
      "abbreviation": "Ser",
      "days": 30,
      "description": "Rain Month. Autumn storms wash the land clean as the skies weep for the dying year and the approaching darkness."
    },
    {
      "name": "Morangal",
      "abbreviation": "Mor",
      "days": 30,
      "description": "Darkness Month. The deepest winter month when shadows reign supreme and the boundary between worlds grows thin and treacherous."
    },
    {
      "name": "Ofelya",
      "abbreviation": "Ofe",
      "days": 30,
      "description": "Midwinter Month. The heart of winter's grip, when cold holds the land in its icy fist and survival becomes the only concern."
    },
    {
      "name": "Agani",
      "abbreviation": "Aga",
      "days": 30,
      "description": "Indigent Month. The month of want and need, when stores run low and the hungry time tests the resolve of all living things."
    },
    {
      "name": "Elisal",
      "abbreviation": "Eli",
      "days": 30,
      "description": "Thaw Month. Winter's grip begins to loosen as ice melts and the first hints of spring stir beneath the warming earth."
    },
    {
      "name": "Verion",
      "abbreviation": "Ver",
      "days": 30,
      "description": "Sowing Month. The time of planting and new beginnings, when seeds are placed in fertile soil with hope for future abundance."
    },
    {
      "name": "Konelia",
      "abbreviation": "Kon",
      "days": 30,
      "description": "Blooming Month. Spring reaches its crescendo as flowers burst forth and the world awakens in vibrant, living color."
    },
    {
      "name": "Leandro",
      "abbreviation": "Lea",
      "days": 30,
      "description": "Luscious Month. Early summer brings lush growth and verdant beauty as nature displays its full, fertile power."
    }
  ],
  
  "weekdays": [
    {
      "name": "Earth day",
      "abbreviation": "Ea",
      "description": "The day of the earth, devoted to grounding, stability, and connection with the solid foundations of existence"
    },
    {
      "name": "Water day",
      "abbreviation": "Wa",
      "description": "The day of the water, associated with flow, emotion, cleansing, and the ever-changing currents of life"
    },
    {
      "name": "Wind day",
      "abbreviation": "Wi",
      "description": "The day of the wind, representing movement, change, communication, and the invisible forces that shape the world"
    },
    {
      "name": "Forest day",
      "abbreviation": "Fo",
      "description": "The day of the forest, sacred to nature, growth, the wild places, and the ancient wisdom of trees"
    },
    {
      "name": "Mountain day",
      "abbreviation": "Mo",
      "description": "The day of the mountains, symbolizing endurance, majesty, permanence, and the unchanging pillars of creation"
    },
    {
      "name": "People's day",
      "abbreviation": "Pe",
      "description": "The day of the people, devoted to community, relationships, cooperation, and the bonds that unite civilization"
    },
    {
      "name": "Feast day",
      "abbreviation": "Fe",
      "description": "The day of the sun and feast, a time for celebration, rest, joy, and honoring the light that sustains all life"
    }
  ],
  
  "intercalary": [],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}