{
  "id": "traveller-imperial",
  "translations": {
    "en": {
      "label": "Imperial Calendar (Traveller)",
      "description": "The standardized Imperial Calendar used throughout the Third Imperium in the Traveller universe. Features a simplified system with a single 364-day year preceded by a holiday.",
      "setting": "Traveller RPG"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 1000,
    "prefix": "",
    "suffix": "",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "none"
  },
  
  "months": [
    {
      "name": "Year",
      "abbreviation": "Yea",
      "days": 364,
      "description": "The standard Imperial year consists of exactly 364 days, numbered sequentially from 001 to 364 for administrative efficiency across the vast reaches of the Third Imperium. This standardization allows for consistent scheduling and coordination across thousands of worlds with vastly different orbital periods."
    }
  ],
  
  "weekdays": [
    {
      "name": "Wonday",
      "abbreviation": "Wo",
      "description": "First day of the Imperial standard week, traditionally a day for beginning new ventures and cycles"
    },
    {
      "name": "Tuday",
      "abbreviation": "Tu",
      "description": "Second day of the Imperial week, devoted to administrative tasks and bureaucratic duties"
    },
    {
      "name": "Thirday",
      "abbreviation": "Th",
      "description": "Third day of the Imperial week, commonly used for trade, commerce, and interstellar business"
    },
    {
      "name": "Forday",
      "abbreviation": "Fo",
      "description": "Fourth day of the Imperial week, often designated for travel and transportation scheduling"
    },
    {
      "name": "Fiday",
      "abbreviation": "Fi",
      "description": "Fifth day of the Imperial week, typically reserved for cultural activities and entertainment"
    },
    {
      "name": "Sixday",
      "abbreviation": "Si",
      "description": "Sixth day of the Imperial week, commonly used for maintenance, repairs, and technical work"
    },
    {
      "name": "Senday",
      "abbreviation": "Se",
      "description": "Seventh day of the Imperial week, traditionally a day of rest and personal pursuits across the Imperium"
    }
  ],
  
  "intercalary": [
    {
      "name": "Holiday",
      "after": "Year",
      "leapYearOnly": false,
      "countsForWeekdays": true,
      "description": "The Imperial Holiday marks the transition between years, serving as a universal celebration and administrative reset point across all worlds of the Third Imperium. This single day allows for synchronized Imperial-wide activities and provides a standardized reference point for interstellar coordination."
    }
  ],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}