{
  "id": "warhammer",
  "translations": {
    "en": {
      "label": "Imperial Calendar (Warhammer Fantasy)",
      "description": "The calendar of the Empire in the Old World, featuring irregular months and feast days that mark the passage of seasons in the grim darkness of the Warhammer Fantasy setting.",
      "setting": "Warhammer Fantasy"
    }
  },
  
  "year": {
    "epoch": 0,
    "currentYear": 2522,
    "prefix": "",
    "suffix": "",
    "startDay": 0
  },
  
  "leapYear": {
    "rule": "none"
  },
  
  "months": [
    {
      "name": "Nachexen",
      "abbreviation": "Nac",
      "days": 32,
      "description": "After Witching. The first month of the year, following the dark and dangerous time of winter's grip and magical chaos."
    },
    {
      "name": "Jahrdrung",
      "abbreviation": "Jah",
      "days": 33,
      "description": "Year's Turn. The month when the year truly begins to turn toward spring, though winter's cold still holds the land."
    },
    {
      "name": "Pflugzeit",
      "abbreviation": "Pfl",
      "days": 33,
      "description": "Plough Time. The month of preparing the fields and beginning the agricultural work that will feed the Empire through the year."
    },
    {
      "name": "Sigmarzeit",
      "abbreviation": "Sig",
      "days": 33,
      "description": "Sigmar's Time. Named after the Empire's patron god, a month of renewal, faith, and preparation for the challenges ahead."
    },
    {
      "name": "Sommerzeit",
      "abbreviation": "Som",
      "days": 33,
      "description": "Summer Time. The height of the warm season when crops grow strong and the Empire's armies march to protect its borders."
    },
    {
      "name": "Vorgeheim",
      "abbreviation": "Vor",
      "days": 33,
      "description": "Before Mystery. The month leading up to the mysterious and dangerous time when dark forces stir in the shadows."
    },
    {
      "name": "Nachgeheim",
      "abbreviation": "Nac",
      "days": 32,
      "description": "After Mystery. The month following the time of secrets and hidden dangers, when the Empire recovers from supernatural threats."
    },
    {
      "name": "Erntezeit",
      "abbreviation": "Ern",
      "days": 33,
      "description": "Harvest Time. The crucial month of gathering crops and preparing for winter's inevitable return to the Empire's lands."
    },
    {
      "name": "Brauzeit",
      "abbreviation": "Bra",
      "days": 33,
      "description": "Brewing Time. The month of fermenting and preserving, when ale and other provisions are prepared for the dark months ahead."
    },
    {
      "name": "Kaldezeit",
      "abbreviation": "Kal",
      "days": 33,
      "description": "Cold Time. Winter arrives in earnest, bringing hardship and testing the Empire's resilience against both nature and its enemies."
    },
    {
      "name": "Ulriczeit",
      "abbreviation": "Ulr",
      "days": 33,
      "description": "Ulric's Time. Named after the god of winter and wolves, the harshest month when survival becomes the primary concern."
    },
    {
      "name": "Vorhexen",
      "abbreviation": "Vor",
      "days": 33,
      "description": "Before Witching. The final month of the year, building toward the dangerous and magical time when dark powers reach their peak."
    }
  ],
  
  "weekdays": [
    {
      "name": "Wellentag",
      "abbreviation": "We",
      "description": "Workday. The first day of the week devoted to labor and the beginning of productive endeavors"
    },
    {
      "name": "Aubentag",
      "abbreviation": "Au",
      "description": "Aubentag. A day associated with the color auburn and the turning of seasons"
    },
    {
      "name": "Marktag",
      "abbreviation": "Ma",
      "description": "Market Day. The primary day for trade, commerce, and the exchange of goods throughout the Empire"
    },
    {
      "name": "Backertag",
      "abbreviation": "Ba",
      "description": "Baker's Day. A day devoted to the preparation of bread and other baked goods essential for survival"
    },
    {
      "name": "Bezahltag",
      "abbreviation": "Be",
      "description": "Pay Day. The day when wages are given and debts are settled throughout the Empire's cities and towns"
    },
    {
      "name": "Konistag",
      "abbreviation": "Ko",
      "description": "King's Day. A day devoted to the authority of rulers and the hierarchy that maintains order in the Empire"
    },
    {
      "name": "Angestag",
      "abbreviation": "An",
      "description": "Start Day. The beginning of important undertakings and the planning of significant ventures"
    },
    {
      "name": "Festag",
      "abbreviation": "Fe",
      "description": "Feast Day. The day of rest, celebration, and worship when the Empire's people gather to honor the gods"
    }
  ],
  
  "intercalary": [
    {
      "name": "Hexenstag",
      "after": "Vorhexen",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Witching Night. The most dangerous night of the year when dark magic reaches its peak and terrible things stalk the Empire."
    },
    {
      "name": "Mitterfruhl",
      "after": "Jahrdrung",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Middle Spring. A day marking the true center of spring when the natural world awakens from winter's grip."
    },
    {
      "name": "Sonnstill",
      "after": "Sommerzeit",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Sun's Still. The summer solstice when the sun reaches its highest point and light dominates the Empire."
    },
    {
      "name": "Geheimnistag",
      "after": "Vorgeheim",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Mystery Day. A day of secrets and hidden knowledge when the boundaries between worlds grow thin and dangerous."
    },
    {
      "name": "Mittherbst",
      "after": "Erntezeit",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Middle Autumn. The heart of the harvest season when the Empire gathers its strength for the approaching winter."
    },
    {
      "name": "Mondstille",
      "after": "Ulriczeit",
      "leapYearOnly": false,
      "countsForWeekdays": false,
      "description": "Moon's Still. The winter solstice when darkness reaches its peak and the Empire huddles against the cold and supernatural threats."
    }
  ],
  
  "time": {
    "hoursInDay": 24,
    "minutesInHour": 60,
    "secondsInMinute": 60
  }
}